HW2/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('PG','PG-13')) ORDER BY release_date
---
  def index

    if params[:ratings]
      session[:ratings] = params[:ratings]
    else
      params[:ratings] = session[:ratings]
    end
    params[:order] ||= session[:order]
    session[:order] = params[:order]


    if params[:ratings]
      @all_ratings = Hash[Movie.ratings.collect { |v| [v, params[:ratings].has_key?(v)] }]